driver-tests/etlse/requestReplyBpel/RequestReplyBpelJbi/test/requestUsingBpel/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="http://com.sun.jbi/etl/etlengine/invokeEtl">
  <soapenv:Body>
    <inv:item>
      <inv:value>?string?</inv:value>
    </inv:item>
  </soapenv:Body>
</soapenv:Envelope>