driver-tests/etlse/requestReply/RequestReplyJbi/test/jbiMessage/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:etl="http://com.sun.jbi/etl/etlengine">
  <soapenv:Body>
    <etl:item>
      <etl:value>?string?</etl:value>
    </etl:item>
  </soapenv:Body>
</soapenv:Envelope>