driver-tests/etlse/requestReplyBpel/RequestReplyBpelJbi/test/requestUsingBpel/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://com.sun.jbi/etl/etlengine/invokeEtl" xmlns="http://com.sun.jbi/etl/etlengine/invokeEtl">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://com.sun.jbi/etl/etlengine/invokeEtl">
    <ns2:value xmlns:ns2="http://com.sun.jbi/etl/etlengine/invokeEtl">SUCCESS</ns2:value>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
